SkydiverMCU/mcu-iap-demo/STAR-MC1/MM32F5370/USB_Custom_HID/MM32F5370_HID_Application/Device/MM32F5370/Include/reg_flash.h
/**
  * @brief FLASH_OBR Register Bit Definition
  */
#define  FLASH_OBR_OPTERR_Pos                     (0)
#define  FLASH_OBR_OPTERR_Msk                     (0x1U << FLASH_OBR_OPTERR_Pos)                    /*!<Read protection level status When setting to '1' , it indicates that the Flash memory is read protected. Note: The bit is read-only.*/
#define  FLASH_OBR_OPTERR                         FLASH_OBR_OPTERR_Msk
#define  FLASH_OBR_RDPRT_Pos                      (1)
#define  FLASH_OBR_RDPRT_Msk                      (0x1U << FLASH_OBR_RDPRT_Pos)                     /*!<Read protection level status When setting to '1' , it indicates that the Flash memory is read protected. Note: The bit is read-only.*/
#define  FLASH_OBR_RDPRT                          FLASH_OBR_RDPRT_Msk
#define  FLASH_OBR_WDG_SW_Pos                     (2)
#define  FLASH_OBR_WDG_SW_Msk                     (0x1U << FLASH_OBR_WDG_SW_Pos)                    /*!<*/
#define  FLASH_OBR_WDG_SW                         FLASH_OBR_WDG_SW_Msk
#define  FLASH_OBR_nRST_STOP_Pos                  (3)
#define  FLASH_OBR_nRST_STOP_Msk                  (0x1U << FLASH_OBR_nRST_STOP_Pos)                 /*!<Reset event in stop mode*/
#define  FLASH_OBR_nRST_STOP                      FLASH_OBR_nRST_STOP_Msk
#define  FLASH_OBR_nRST_STANDBY_Pos               (4)
#define  FLASH_OBR_nRST_STANDBY_Msk               (0x1U << FLASH_OBR_nRST_STANDBY_Pos)              /*!<Reset event in standby mode*/
#define  FLASH_OBR_nRST_STANDBY                   FLASH_OBR_nRST_STANDBY_Msk
#define  FLASH_OBR_FLASH_ECCEN_Pos                (7)
#define  FLASH_OBR_FLASH_ECCEN_Msk                (0x1U << FLASH_OBR_FLASH_ECCEN_Pos)               /*!<*/
#define  FLASH_OBR_FLASH_ECCEN                    FLASH_OBR_FLASH_ECCEN_Msk
#define  FLASH_OBR_SRAM_ECCEN_Pos                 (8)
#define  FLASH_OBR_SRAM_ECCEN_Msk                 (0x1U << FLASH_OBR_SRAM_ECCEN_Pos)                /*!<*/
#define  FLASH_OBR_SRAM_ECCEN                     FLASH_OBR_SRAM_ECCEN_Msk
#define  FLASH_OBR_Data0_Pos                      (10)
#define  FLASH_OBR_Data0_Msk                      (0xFFU << FLASH_OBR_Data0_Pos)                    /*!<Data0*/
#define  FLASH_OBR_Data0                          FLASH_OBR_Data0_Msk
#define  FLASH_OBR_Data0_Bit0                     (0x01U << FLASH_OBR_Data0_Pos) 
#define  FLASH_OBR_Data0_Bit1                     (0x02U << FLASH_OBR_Data0_Pos) 
#define  FLASH_OBR_Data0_Bit2                     (0x04U << FLASH_OBR_Data0_Pos) 
#define  FLASH_OBR_Data0_Bit3                     (0x08U << FLASH_OBR_Data0_Pos) 
#define  FLASH_OBR_Data0_Bit4                     (0x10U << FLASH_OBR_Data0_Pos) 
#define  FLASH_OBR_Data0_Bit5                     (0x20U << FLASH_OBR_Data0_Pos) 
#define  FLASH_OBR_Data0_Bit6                     (0x40U << FLASH_OBR_Data0_Pos) 
#define  FLASH_OBR_Data0_Bit7                     (0x80U << FLASH_OBR_Data0_Pos) 
#define  FLASH_OBR_Data1_Pos                      (18)
#define  FLASH_OBR_Data1_Msk                      (0xFFU << FLASH_OBR_Data1_Pos)                    /*!<Data1*/
#define  FLASH_OBR_Data1                          FLASH_OBR_Data1_Msk
#define  FLASH_OBR_Data1_Bit0                     (0x01U << FLASH_OBR_Data1_Pos) 
#define  FLASH_OBR_Data1_Bit1                     (0x02U << FLASH_OBR_Data1_Pos) 
#define  FLASH_OBR_Data1_Bit2                     (0x04U << FLASH_OBR_Data1_Pos) 
#define  FLASH_OBR_Data1_Bit3                     (0x08U << FLASH_OBR_Data1_Pos) 
#define  FLASH_OBR_Data1_Bit4                     (0x10U << FLASH_OBR_Data1_Pos) 
#define  FLASH_OBR_Data1_Bit5                     (0x20U << FLASH_OBR_Data1_Pos) 
#define  FLASH_OBR_Data1_Bit6                     (0x40U << FLASH_OBR_Data1_Pos) 
#define  FLASH_OBR_Data1_Bit7                     (0x80U << FLASH_OBR_Data1_Pos) 

/**
  * @brief FLASH_WRPR Register Bit Definition
  */
#define  FLASH_WRPR_WRP_Pos                       (0)
#define  FLASH_WRPR_WRP_Msk                       (0xFFFFU << FLASH_WRPR_WRP_Pos)                   /*!<Write protection The register includes the write protection option byte loaded by OBL.*/
#define  FLASH_WRPR_WRP                           FLASH_WRPR_WRP_Msk
#define  FLASH_WRPR_WRP_Bit0                      (0x0001U << FLASH_WRPR_WRP_Pos) 
#define  FLASH_WRPR_WRP_Bit1                      (0x0002U << FLASH_WRPR_WRP_Pos) 
#define  FLASH_WRPR_WRP_Bit2                      (0x0004U << FLASH_WRPR_WRP_Pos) 
#define  FLASH_WRPR_WRP_Bit3                      (0x0008U << FLASH_WRPR_WRP_Pos) 
#define  FLASH_WRPR_WRP_Bit4                      (0x0010U << FLASH_WRPR_WRP_Pos) 
#define  FLASH_WRPR_WRP_Bit5                      (0x0020U << FLASH_WRPR_WRP_Pos) 
#define  FLASH_WRPR_WRP_Bit6                      (0x0040U << FLASH_WRPR_WRP_Pos) 
#define  FLASH_WRPR_WRP_Bit7                      (0x0080U << FLASH_WRPR_WRP_Pos) 
#define  FLASH_WRPR_WRP_Bit8                      (0x0100U << FLASH_WRPR_WRP_Pos) 
#define  FLASH_WRPR_WRP_Bit9                      (0x0200U << FLASH_WRPR_WRP_Pos) 
#define  FLASH_WRPR_WRP_Bit10                     (0x0400U << FLASH_WRPR_WRP_Pos) 
#define  FLASH_WRPR_WRP_Bit11                     (0x0800U << FLASH_WRPR_WRP_Pos) 
#define  FLASH_WRPR_WRP_Bit12                     (0x1000U << FLASH_WRPR_WRP_Pos) 
#define  FLASH_WRPR_WRP_Bit13                     (0x2000U << FLASH_WRPR_WRP_Pos) 
#define  FLASH_WRPR_WRP_Bit14                     (0x4000U << FLASH_WRPR_WRP_Pos) 
#define  FLASH_WRPR_WRP_Bit15                     (0x8000U << FLASH_WRPR_WRP_Pos) 

/**
  * @brief FLASH_BPRT Register Bit Definition
  */
#define  FLASH_BPRT_BPRT_START_Pos                (0)
#define  FLASH_BPRT_BPRT_START_Msk                (0xFFFU << FLASH_BPRT_BPRT_START_Pos)             /*!<*/
#define  FLASH_BPRT_BPRT_START                    FLASH_BPRT_BPRT_START_Msk
#define  FLASH_BPRT_BPRT_START_Bit0               (0x001U << FLASH_BPRT_BPRT_START_Pos) 
#define  FLASH_BPRT_BPRT_START_Bit1               (0x002U << FLASH_BPRT_BPRT_START_Pos) 
#define  FLASH_BPRT_BPRT_START_Bit2               (0x004U << FLASH_BPRT_BPRT_START_Pos) 
#define  FLASH_BPRT_BPRT_START_Bit3               (0x008U << FLASH_BPRT_BPRT_START_Pos) 
#define  FLASH_BPRT_BPRT_START_Bit4               (0x010U << FLASH_BPRT_BPRT_START_Pos) 
#define  FLASH_BPRT_BPRT_START_Bit5               (0x020U << FLASH_BPRT_BPRT_START_Pos) 
#define  FLASH_BPRT_BPRT_START_Bit6               (0x040U << FLASH_BPRT_BPRT_START_Pos) 
#define  FLASH_BPRT_BPRT_START_Bit7               (0x080U << FLASH_BPRT_BPRT_START_Pos) 
#define  FLASH_BPRT_BPRT_START_Bit8               (0x100U << FLASH_BPRT_BPRT_START_Pos) 
#define  FLASH_BPRT_BPRT_START_Bit9               (0x200U << FLASH_BPRT_BPRT_START_Pos) 
#define  FLASH_BPRT_BPRT_START_Bit10              (0x400U << FLASH_BPRT_BPRT_START_Pos) 
#define  FLASH_BPRT_BPRT_START_Bit11              (0x800U << FLASH_BPRT_BPRT_START_Pos) 
#define  FLASH_BPRT_BPRT_END_Pos                  (16)
#define  FLASH_BPRT_BPRT_END_Msk                  (0xFFFU << FLASH_BPRT_BPRT_END_Pos)               /*!<*/
#define  FLASH_BPRT_BPRT_END                      FLASH_BPRT_BPRT_END_Msk
#define  FLASH_BPRT_BPRT_END_Bit0                 (0x001U << FLASH_BPRT_BPRT_END_Pos) 
#define  FLASH_BPRT_BPRT_END_Bit1                 (0x002U << FLASH_BPRT_BPRT_END_Pos) 
#define  FLASH_BPRT_BPRT_END_Bit2                 (0x004U << FLASH_BPRT_BPRT_END_Pos) 
#define  FLASH_BPRT_BPRT_END_Bit3                 (0x008U << FLASH_BPRT_BPRT_END_Pos) 
#define  FLASH_BPRT_BPRT_END_Bit4                 (0x010U << FLASH_BPRT_BPRT_END_Pos) 
#define  FLASH_BPRT_BPRT_END_Bit5                 (0x020U << FLASH_BPRT_BPRT_END_Pos) 
#define  FLASH_BPRT_BPRT_END_Bit6                 (0x040U << FLASH_BPRT_BPRT_END_Pos) 
#define  FLASH_BPRT_BPRT_END_Bit7                 (0x080U << FLASH_BPRT_BPRT_END_Pos) 
#define  FLASH_BPRT_BPRT_END_Bit8                 (0x100U << FLASH_BPRT_BPRT_END_Pos) 
#define  FLASH_BPRT_BPRT_END_Bit9                 (0x200U << FLASH_BPRT_BPRT_END_Pos) 
#define  FLASH_BPRT_BPRT_END_Bit10                (0x400U << FLASH_BPRT_BPRT_END_Pos) 
#define  FLASH_BPRT_BPRT_END_Bit11                (0x800U << FLASH_BPRT_BPRT_END_Pos) 
#define  FLASH_BPRT_BPRT_RDP_Pos                  (31)
#define  FLASH_BPRT_BPRT_RDP_Msk                  (0x1U << FLASH_BPRT_BPRT_RDP_Pos)                 /*!<*/
#define  FLASH_BPRT_BPRT_RDP                      FLASH_BPRT_BPRT_RDP_Msk

/**
  * @brief FLASH_ECC_CR Register Bit Definition
  */
#define  FLASH_ECC_CR_RERR_Pos                    (1)
#define  FLASH_ECC_CR_RERR_Msk                    (0x1U << FLASH_ECC_CR_RERR_Pos)                   /*!<*/
#define  FLASH_ECC_CR_RERR                        FLASH_ECC_CR_RERR_Msk

/**
  * @brief FLASH_ECC_PR Register Bit Definition
  */
#define  FLASH_ECC_PR_PRC_Pos                     (0)
#define  FLASH_ECC_PR_PRC_Msk                     (0x1U << FLASH_ECC_PR_PRC_Pos)                    /*!<*/
#define  FLASH_ECC_PR_PRC                         FLASH_ECC_PR_PRC_Msk

/**
  * @brief FLASH_ECC_EER Register Bit Definition
  */
#define  FLASH_ECC_EER_1BITIE_Pos                 (0)
#define  FLASH_ECC_EER_1BITIE_Msk                 (0x1U << FLASH_ECC_EER_1BITIE_Pos)                /*!<*/
#define  FLASH_ECC_EER_1BITIE                     FLASH_ECC_EER_1BITIE_Msk
#define  FLASH_ECC_EER_2BITIE_Pos                 (1)
#define  FLASH_ECC_EER_2BITIE_Msk                 (0x1U << FLASH_ECC_EER_2BITIE_Pos)                /*!<*/
#define  FLASH_ECC_EER_2BITIE                     FLASH_ECC_EER_2BITIE_Msk

/**
  * @brief FLASH_ECC_SR Register Bit Definition
  */
#define  FLASH_ECC_SR_1BITF_Pos                   (0)
#define  FLASH_ECC_SR_1BITF_Msk                   (0x1U << FLASH_ECC_SR_1BITF_Pos)                  /*!<*/
#define  FLASH_ECC_SR_1BITF                       FLASH_ECC_SR_1BITF_Msk
#define  FLASH_ECC_SR_2BITF_Pos                   (1)
#define  FLASH_ECC_SR_2BITF_Msk                   (0x1U << FLASH_ECC_SR_2BITF_Pos)                  /*!<*/
#define  FLASH_ECC_SR_2BITF                       FLASH_ECC_SR_2BITF_Msk

/**
  * @brief FLASH_ECC_ADDRR Register Bit Definition
  */
#define  FLASH_ECC_ADDRR_ADDR_Pos                 (0)
#define  FLASH_ECC_ADDRR_ADDR_Msk                 (0xFFFFFFFFU << FLASH_ECC_ADDRR_ADDR_Pos)         /*!<*/
#define  FLASH_ECC_ADDRR_ADDR                     FLASH_ECC_ADDRR_ADDR_Msk
#define  FLASH_ECC_ADDRR_ADDR_Bit0                (0x00000001U << FLASH_ECC_ADDRR_ADDR_Pos) 
#define  FLASH_ECC_ADDRR_ADDR_Bit1                (0x00000002U << FLASH_ECC_ADDRR_ADDR_Pos) 
#define  FLASH_ECC_ADDRR_ADDR_Bit2                (0x00000004U << FLASH_ECC_ADDRR_ADDR_Pos) 
#define  FLASH_ECC_ADDRR_ADDR_Bit3                (0x00000008U << FLASH_ECC_ADDRR_ADDR_Pos) 
#define  FLASH_ECC_ADDRR_ADDR_Bit4                (0x00000010U << FLASH_ECC_ADDRR_ADDR_Pos) 
#define  FLASH_ECC_ADDRR_ADDR_Bit5                (0x00000020U << FLASH_ECC_ADDRR_ADDR_Pos) 
#define  FLASH_ECC_ADDRR_ADDR_Bit6                (0x00000040U << FLASH_ECC_ADDRR_ADDR_Pos) 
#define  FLASH_ECC_ADDRR_ADDR_Bit7                (0x00000080U << FLASH_ECC_ADDRR_ADDR_Pos) 
#define  FLASH_ECC_ADDRR_ADDR_Bit8                (0x00000100U << FLASH_ECC_ADDRR_ADDR_Pos) 
#define  FLASH_ECC_ADDRR_ADDR_Bit9                (0x00000200U << FLASH_ECC_ADDRR_ADDR_Pos) 
#define  FLASH_ECC_ADDRR_ADDR_Bit10               (0x00000400U << FLASH_ECC_ADDRR_ADDR_Pos) 
#define  FLASH_ECC_ADDRR_ADDR_Bit11               (0x00000800U << FLASH_ECC_ADDRR_ADDR_Pos) 
#define  FLASH_ECC_ADDRR_ADDR_Bit12               (0x00001000U << FLASH_ECC_ADDRR_ADDR_Pos) 
#define  FLASH_ECC_ADDRR_ADDR_Bit13               (0x00002000U << FLASH_ECC_ADDRR_ADDR_Pos) 
#define  FLASH_ECC_ADDRR_ADDR_Bit14               (0x00004000U << FLASH_ECC_ADDRR_ADDR_Pos) 
#define  FLASH_ECC_ADDRR_ADDR_Bit15               (0x00008000U << FLASH_ECC_ADDRR_ADDR_Pos) 
#define  FLASH_ECC_ADDRR_ADDR_Bit16               (0x00010000U << FLASH_ECC_ADDRR_ADDR_Pos) 
#define  FLASH_ECC_ADDRR_ADDR_Bit17               (0x00020000U << FLASH_ECC_ADDRR_ADDR_Pos) 
#define  FLASH_ECC_ADDRR_ADDR_Bit18               (0x00040000U << FLASH_ECC_ADDRR_ADDR_Pos) 
#define  FLASH_ECC_ADDRR_ADDR_Bit19               (0x00080000U << FLASH_ECC_ADDRR_ADDR_Pos) 
#define  FLASH_ECC_ADDRR_ADDR_Bit20               (0x00100000U << FLASH_ECC_ADDRR_ADDR_Pos) 
#define  FLASH_ECC_ADDRR_ADDR_Bit21               (0x00200000U << FLASH_ECC_ADDRR_ADDR_Pos) 
#define  FLASH_ECC_ADDRR_ADDR_Bit22               (0x00400000U << FLASH_ECC_ADDRR_ADDR_Pos) 
#define  FLASH_ECC_ADDRR_ADDR_Bit23               (0x00800000U << FLASH_ECC_ADDRR_ADDR_Pos) 
#define  FLASH_ECC_ADDRR_ADDR_Bit24               (0x01000000U << FLASH_ECC_ADDRR_ADDR_Pos) 
#define  FLASH_ECC_ADDRR_ADDR_Bit25               (0x02000000U << FLASH_ECC_ADDRR_ADDR_Pos) 
#define  FLASH_ECC_ADDRR_ADDR_Bit26               (0x04000000U << FLASH_ECC_ADDRR_ADDR_Pos) 
#define  FLASH_ECC_ADDRR_ADDR_Bit27               (0x08000000U << FLASH_ECC_ADDRR_ADDR_Pos) 
#define  FLASH_ECC_ADDRR_ADDR_Bit28               (0x10000000U << FLASH_ECC_ADDRR_ADDR_Pos) 
#define  FLASH_ECC_ADDRR_ADDR_Bit29               (0x20000000U << FLASH_ECC_ADDRR_ADDR_Pos) 
#define  FLASH_ECC_ADDRR_ADDR_Bit30               (0x40000000U << FLASH_ECC_ADDRR_ADDR_Pos) 
#define  FLASH_ECC_ADDRR_ADDR_Bit31               (0x80000000U << FLASH_ECC_ADDRR_ADDR_Pos) 

/**
  * @brief FLASH_ECC_SYNR Register Bit Definition
  */
#define  FLASH_ECC_SYNR_SYN_Pos                   (0)
#define  FLASH_ECC_SYNR_SYN_Msk                   (0xFFU << FLASH_ECC_SYNR_SYN_Pos)                 /*!<*/
#define  FLASH_ECC_SYNR_SYN                       FLASH_ECC_SYNR_SYN_Msk
#define  FLASH_ECC_SYNR_SYN_Bit0                  (0x01U << FLASH_ECC_SYNR_SYN_Pos) 
#define  FLASH_ECC_SYNR_SYN_Bit1                  (0x02U << FLASH_ECC_SYNR_SYN_Pos) 
#define  FLASH_ECC_SYNR_SYN_Bit2                  (0x04U << FLASH_ECC_SYNR_SYN_Pos) 
#define  FLASH_ECC_SYNR_SYN_Bit3                  (0x08U << FLASH_ECC_SYNR_SYN_Pos) 
#define  FLASH_ECC_SYNR_SYN_Bit4                  (0x10U << FLASH_ECC_SYNR_SYN_Pos) 
#define  FLASH_ECC_SYNR_SYN_Bit5                  (0x20U << FLASH_ECC_SYNR_SYN_Pos) 
#define  FLASH_ECC_SYNR_SYN_Bit6                  (0x40U << FLASH_ECC_SYNR_SYN_Pos) 
#define  FLASH_ECC_SYNR_SYN_Bit7                  (0x80U << FLASH_ECC_SYNR_SYN_Pos) 

/**
  * @brief FLASH_ECC_DLR Register Bit Definition
  */
#define  FLASH_ECC_DLR_DATAL_Pos                  (0)
#define  FLASH_ECC_DLR_DATAL_Msk                  (0xFFFFFFFFU << FLASH_ECC_DLR_DATAL_Pos)          /*!<*/
#define  FLASH_ECC_DLR_DATAL                      FLASH_ECC_DLR_DATAL_Msk
#define  FLASH_ECC_DLR_DATAL_Bit0                 (0x00000001U << FLASH_ECC_DLR_DATAL_Pos) 
#define  FLASH_ECC_DLR_DATAL_Bit1                 (0x00000002U << FLASH_ECC_DLR_DATAL_Pos) 
#define  FLASH_ECC_DLR_DATAL_Bit2                 (0x00000004U << FLASH_ECC_DLR_DATAL_Pos) 
#define  FLASH_ECC_DLR_DATAL_Bit3                 (0x00000008U << FLASH_ECC_DLR_DATAL_Pos) 
#define  FLASH_ECC_DLR_DATAL_Bit4                 (0x00000010U << FLASH_ECC_DLR_DATAL_Pos) 
#define  FLASH_ECC_DLR_DATAL_Bit5                 (0x00000020U << FLASH_ECC_DLR_DATAL_Pos) 
#define  FLASH_ECC_DLR_DATAL_Bit6                 (0x00000040U << FLASH_ECC_DLR_DATAL_Pos) 
#define  FLASH_ECC_DLR_DATAL_Bit7                 (0x00000080U << FLASH_ECC_DLR_DATAL_Pos) 
#define  FLASH_ECC_DLR_DATAL_Bit8                 (0x00000100U << FLASH_ECC_DLR_DATAL_Pos) 
#define  FLASH_ECC_DLR_DATAL_Bit9                 (0x00000200U << FLASH_ECC_DLR_DATAL_Pos) 
#define  FLASH_ECC_DLR_DATAL_Bit10                (0x00000400U << FLASH_ECC_DLR_DATAL_Pos) 
#define  FLASH_ECC_DLR_DATAL_Bit11                (0x00000800U << FLASH_ECC_DLR_DATAL_Pos) 
#define  FLASH_ECC_DLR_DATAL_Bit12                (0x00001000U << FLASH_ECC_DLR_DATAL_Pos) 
#define  FLASH_ECC_DLR_DATAL_Bit13                (0x00002000U << FLASH_ECC_DLR_DATAL_Pos) 
#define  FLASH_ECC_DLR_DATAL_Bit14                (0x00004000U << FLASH_ECC_DLR_DATAL_Pos) 
#define  FLASH_ECC_DLR_DATAL_Bit15                (0x00008000U << FLASH_ECC_DLR_DATAL_Pos) 
#define  FLASH_ECC_DLR_DATAL_Bit16                (0x00010000U << FLASH_ECC_DLR_DATAL_Pos) 
#define  FLASH_ECC_DLR_DATAL_Bit17                (0x00020000U << FLASH_ECC_DLR_DATAL_Pos) 
#define  FLASH_ECC_DLR_DATAL_Bit18                (0x00040000U << FLASH_ECC_DLR_DATAL_Pos) 
#define  FLASH_ECC_DLR_DATAL_Bit19                (0x00080000U << FLASH_ECC_DLR_DATAL_Pos) 
#define  FLASH_ECC_DLR_DATAL_Bit20                (0x00100000U << FLASH_ECC_DLR_DATAL_Pos) 
#define  FLASH_ECC_DLR_DATAL_Bit21                (0x00200000U << FLASH_ECC_DLR_DATAL_Pos) 
#define  FLASH_ECC_DLR_DATAL_Bit22                (0x00400000U << FLASH_ECC_DLR_DATAL_Pos) 
#define  FLASH_ECC_DLR_DATAL_Bit23                (0x00800000U << FLASH_ECC_DLR_DATAL_Pos) 
#define  FLASH_ECC_DLR_DATAL_Bit24                (0x01000000U << FLASH_ECC_DLR_DATAL_Pos) 
#define  FLASH_ECC_DLR_DATAL_Bit25                (0x02000000U << FLASH_ECC_DLR_DATAL_Pos) 
#define  FLASH_ECC_DLR_DATAL_Bit26                (0x04000000U << FLASH_ECC_DLR_DATAL_Pos) 
#define  FLASH_ECC_DLR_DATAL_Bit27                (0x08000000U << FLASH_ECC_DLR_DATAL_Pos) 
#define  FLASH_ECC_DLR_DATAL_Bit28                (0x10000000U << FLASH_ECC_DLR_DATAL_Pos) 
#define  FLASH_ECC_DLR_DATAL_Bit29                (0x20000000U << FLASH_ECC_DLR_DATAL_Pos) 
#define  FLASH_ECC_DLR_DATAL_Bit30                (0x40000000U << FLASH_ECC_DLR_DATAL_Pos) 
#define  FLASH_ECC_DLR_DATAL_Bit31                (0x80000000U << FLASH_ECC_DLR_DATAL_Pos) 

/**
  * @brief FLASH_ECC_DHR Register Bit Definition
  */
#define  FLASH_ECC_DHR_DATAH_Pos                  (0)
#define  FLASH_ECC_DHR_DATAH_Msk                  (0xFFFFFFFFU << FLASH_ECC_DHR_DATAH_Pos)          /*!<*/
#define  FLASH_ECC_DHR_DATAH                      FLASH_ECC_DHR_DATAH_Msk
#define  FLASH_ECC_DHR_DATAH_Bit0                 (0x00000001U << FLASH_ECC_DHR_DATAH_Pos) 
#define  FLASH_ECC_DHR_DATAH_Bit1                 (0x00000002U << FLASH_ECC_DHR_DATAH_Pos) 
#define  FLASH_ECC_DHR_DATAH_Bit2                 (0x00000004U << FLASH_ECC_DHR_DATAH_Pos) 
#define  FLASH_ECC_DHR_DATAH_Bit3                 (0x00000008U << FLASH_ECC_DHR_DATAH_Pos) 
#define  FLASH_ECC_DHR_DATAH_Bit4                 (0x00000010U << FLASH_ECC_DHR_DATAH_Pos) 
#define  FLASH_ECC_DHR_DATAH_Bit5                 (0x00000020U << FLASH_ECC_DHR_DATAH_Pos) 
#define  FLASH_ECC_DHR_DATAH_Bit6                 (0x00000040U << FLASH_ECC_DHR_DATAH_Pos) 
#define  FLASH_ECC_DHR_DATAH_Bit7                 (0x00000080U << FLASH_ECC_DHR_DATAH_Pos) 
#define  FLASH_ECC_DHR_DATAH_Bit8                 (0x00000100U << FLASH_ECC_DHR_DATAH_Pos) 
#define  FLASH_ECC_DHR_DATAH_Bit9                 (0x00000200U << FLASH_ECC_DHR_DATAH_Pos) 
#define  FLASH_ECC_DHR_DATAH_Bit10                (0x00000400U << FLASH_ECC_DHR_DATAH_Pos) 
#define  FLASH_ECC_DHR_DATAH_Bit11                (0x00000800U << FLASH_ECC_DHR_DATAH_Pos) 
#define  FLASH_ECC_DHR_DATAH_Bit12                (0x00001000U << FLASH_ECC_DHR_DATAH_Pos) 
#define  FLASH_ECC_DHR_DATAH_Bit13                (0x00002000U << FLASH_ECC_DHR_DATAH_Pos) 
#define  FLASH_ECC_DHR_DATAH_Bit14                (0x00004000U << FLASH_ECC_DHR_DATAH_Pos) 
#define  FLASH_ECC_DHR_DATAH_Bit15                (0x00008000U << FLASH_ECC_DHR_DATAH_Pos) 
#define  FLASH_ECC_DHR_DATAH_Bit16                (0x00010000U << FLASH_ECC_DHR_DATAH_Pos) 
#define  FLASH_ECC_DHR_DATAH_Bit17                (0x00020000U << FLASH_ECC_DHR_DATAH_Pos) 
#define  FLASH_ECC_DHR_DATAH_Bit18                (0x00040000U << FLASH_ECC_DHR_DATAH_Pos) 
#define  FLASH_ECC_DHR_DATAH_Bit19                (0x00080000U << FLASH_ECC_DHR_DATAH_Pos) 
#define  FLASH_ECC_DHR_DATAH_Bit20                (0x00100000U << FLASH_ECC_DHR_DATAH_Pos) 
#define  FLASH_ECC_DHR_DATAH_Bit21                (0x00200000U << FLASH_ECC_DHR_DATAH_Pos) 
#define  FLASH_ECC_DHR_DATAH_Bit22                (0x00400000U << FLASH_ECC_DHR_DATAH_Pos) 
#define  FLASH_ECC_DHR_DATAH_Bit23                (0x00800000U << FLASH_ECC_DHR_DATAH_Pos) 
#define  FLASH_ECC_DHR_DATAH_Bit24                (0x01000000U << FLASH_ECC_DHR_DATAH_Pos) 
#define  FLASH_ECC_DHR_DATAH_Bit25                (0x02000000U << FLASH_ECC_DHR_DATAH_Pos) 
#define  FLASH_ECC_DHR_DATAH_Bit26                (0x04000000U << FLASH_ECC_DHR_DATAH_Pos) 
#define  FLASH_ECC_DHR_DATAH_Bit27                (0x08000000U << FLASH_ECC_DHR_DATAH_Pos) 
#define  FLASH_ECC_DHR_DATAH_Bit28                (0x10000000U << FLASH_ECC_DHR_DATAH_Pos) 
#define  FLASH_ECC_DHR_DATAH_Bit29                (0x20000000U << FLASH_ECC_DHR_DATAH_Pos) 
#define  FLASH_ECC_DHR_DATAH_Bit30                (0x40000000U << FLASH_ECC_DHR_DATAH_Pos) 
#define  FLASH_ECC_DHR_DATAH_Bit31                (0x80000000U << FLASH_ECC_DHR_DATAH_Pos) 

/**
  * @brief FLASH_CKS Register Bit Definition
  */
#define  FLASH_CKS_DIV_Pos                        (0)
#define  FLASH_CKS_DIV_Msk                        (0x3FU << FLASH_CKS_DIV_Pos)                      /*!<*/
#define  FLASH_CKS_DIV                            FLASH_CKS_DIV_Msk
#define  FLASH_CKS_DIV_Bit0                       (0x01U << FLASH_CKS_DIV_Pos) 
#define  FLASH_CKS_DIV_Bit1                       (0x02U << FLASH_CKS_DIV_Pos) 
#define  FLASH_CKS_DIV_Bit2                       (0x04U << FLASH_CKS_DIV_Pos) 
#define  FLASH_CKS_DIV_Bit3                       (0x08U << FLASH_CKS_DIV_Pos) 
#define  FLASH_CKS_DIV_Bit4                       (0x10U << FLASH_CKS_DIV_Pos) 
#define  FLASH_CKS_DIV_Bit5                       (0x20U << FLASH_CKS_DIV_Pos) 
#define  FLASH_CKS_CSEL_Pos                       (6)
#define  FLASH_CKS_CSEL_Msk                       (0x1U << FLASH_CKS_CSEL_Pos)                      /*!<*/
#define  FLASH_CKS_CSEL                           FLASH_CKS_CSEL_Msk

