SkydiverMCU/mcu-iap-demo/STAR-MC1/MM32F5370/USB_Custom_HID/MM32F5370_HID_Application/Device/MM32F5370/Include/reg_flash.h
/**
  * @brief FLASH_BPTKEYR Register Bit Definition
  */
#define  FLASH_BPTKEYR_BPTKEYR_Pos                (0)
#define  FLASH_BPTKEYR_BPTKEYR_Msk                (0xFFFFFFFFU << FLASH_BPTKEYR_BPTKEYR_Pos)        /*!<*/
#define  FLASH_BPTKEYR_BPTKEYR                    FLASH_BPTKEYR_BPTKEYR_Msk
#define  FLASH_BPTKEYR_BPTKEYR_Bit0               (0x00000001U << FLASH_BPTKEYR_BPTKEYR_Pos) 
#define  FLASH_BPTKEYR_BPTKEYR_Bit1               (0x00000002U << FLASH_BPTKEYR_BPTKEYR_Pos) 
#define  FLASH_BPTKEYR_BPTKEYR_Bit2               (0x00000004U << FLASH_BPTKEYR_BPTKEYR_Pos) 
#define  FLASH_BPTKEYR_BPTKEYR_Bit3               (0x00000008U << FLASH_BPTKEYR_BPTKEYR_Pos) 
#define  FLASH_BPTKEYR_BPTKEYR_Bit4               (0x00000010U << FLASH_BPTKEYR_BPTKEYR_Pos) 
#define  FLASH_BPTKEYR_BPTKEYR_Bit5               (0x00000020U << FLASH_BPTKEYR_BPTKEYR_Pos) 
#define  FLASH_BPTKEYR_BPTKEYR_Bit6               (0x00000040U << FLASH_BPTKEYR_BPTKEYR_Pos) 
#define  FLASH_BPTKEYR_BPTKEYR_Bit7               (0x00000080U << FLASH_BPTKEYR_BPTKEYR_Pos) 
#define  FLASH_BPTKEYR_BPTKEYR_Bit8               (0x00000100U << FLASH_BPTKEYR_BPTKEYR_Pos) 
#define  FLASH_BPTKEYR_BPTKEYR_Bit9               (0x00000200U << FLASH_BPTKEYR_BPTKEYR_Pos) 
#define  FLASH_BPTKEYR_BPTKEYR_Bit10              (0x00000400U << FLASH_BPTKEYR_BPTKEYR_Pos) 
#define  FLASH_BPTKEYR_BPTKEYR_Bit11              (0x00000800U << FLASH_BPTKEYR_BPTKEYR_Pos) 
#define  FLASH_BPTKEYR_BPTKEYR_Bit12              (0x00001000U << FLASH_BPTKEYR_BPTKEYR_Pos) 
#define  FLASH_BPTKEYR_BPTKEYR_Bit13              (0x00002000U << FLASH_BPTKEYR_BPTKEYR_Pos) 
#define  FLASH_BPTKEYR_BPTKEYR_Bit14              (0x00004000U << FLASH_BPTKEYR_BPTKEYR_Pos) 
#define  FLASH_BPTKEYR_BPTKEYR_Bit15              (0x00008000U << FLASH_BPTKEYR_BPTKEYR_Pos) 
#define  FLASH_BPTKEYR_BPTKEYR_Bit16              (0x00010000U << FLASH_BPTKEYR_BPTKEYR_Pos) 
#define  FLASH_BPTKEYR_BPTKEYR_Bit17              (0x00020000U << FLASH_BPTKEYR_BPTKEYR_Pos) 
#define  FLASH_BPTKEYR_BPTKEYR_Bit18              (0x00040000U << FLASH_BPTKEYR_BPTKEYR_Pos) 
#define  FLASH_BPTKEYR_BPTKEYR_Bit19              (0x00080000U << FLASH_BPTKEYR_BPTKEYR_Pos) 
#define  FLASH_BPTKEYR_BPTKEYR_Bit20              (0x00100000U << FLASH_BPTKEYR_BPTKEYR_Pos) 
#define  FLASH_BPTKEYR_BPTKEYR_Bit21              (0x00200000U << FLASH_BPTKEYR_BPTKEYR_Pos) 
#define  FLASH_BPTKEYR_BPTKEYR_Bit22              (0x00400000U << FLASH_BPTKEYR_BPTKEYR_Pos) 
#define  FLASH_BPTKEYR_BPTKEYR_Bit23              (0x00800000U << FLASH_BPTKEYR_BPTKEYR_Pos) 
#define  FLASH_BPTKEYR_BPTKEYR_Bit24              (0x01000000U << FLASH_BPTKEYR_BPTKEYR_Pos) 
#define  FLASH_BPTKEYR_BPTKEYR_Bit25              (0x02000000U << FLASH_BPTKEYR_BPTKEYR_Pos) 
#define  FLASH_BPTKEYR_BPTKEYR_Bit26              (0x04000000U << FLASH_BPTKEYR_BPTKEYR_Pos) 
#define  FLASH_BPTKEYR_BPTKEYR_Bit27              (0x08000000U << FLASH_BPTKEYR_BPTKEYR_Pos) 
#define  FLASH_BPTKEYR_BPTKEYR_Bit28              (0x10000000U << FLASH_BPTKEYR_BPTKEYR_Pos) 
#define  FLASH_BPTKEYR_BPTKEYR_Bit29              (0x20000000U << FLASH_BPTKEYR_BPTKEYR_Pos) 
#define  FLASH_BPTKEYR_BPTKEYR_Bit30              (0x40000000U << FLASH_BPTKEYR_BPTKEYR_Pos) 
#define  FLASH_BPTKEYR_BPTKEYR_Bit31              (0x80000000U << FLASH_BPTKEYR_BPTKEYR_Pos) 


#endif

